[
  {
    "st_no": "1",
    "st_text": "Родословие Иисуса Христа, Сына Давидова, Сына Авраамова.",
    "parallel": "1 Пар. 17:11 Лк. 3:23 Рим. 1:3 Рим. 9:5"
  },
  {
    "st_no": "2",
    "st_text": "Авраам родил Исаака; Исаак родил Иакова; Иаков родил Иуду и братьев его;",
    "parallel": "Быт. 21:3 Быт. 25:19 Быт. 29:35"
  },
  {
    "st_no": "3",
    "st_text": "Иуда родил Фареса и Зару от Фамари; Фарес родил Есрома; Есром родил Арама;",
    "parallel": "Быт. 38:27 Быт. 38:30 Быт. 46:12 Руф. 4:18 1 Пар. 2:4 1 Пар. 2:5"
  },
  {
    "st_no": "4",
    "st_text": "Арам родил Аминадава; Аминадав родил Наассона; Наассон родил Салмона;",
    "parallel": ""
  },
  {
    "st_no": "5",
    "st_text": "Салмон родил Вооза от Рахавы; Вооз родил Овида от Руфи; Овид родил Иессея;",
    "parallel": "Нав. 6:24 Руф. 2:3 Руф. 4:17 Руф. 4:21 1 Пар. 2:11"
  },
  {
    "st_no": "6",
    "st_text": "Иессей родил Давида царя; Давид царь родил Соломона от бывшей за Уриею;",
    "parallel": "Быт. 17:6 Быт. 17:16 Руф. 4:17 1 Цар. 17:12 2 Цар. 12:24 1 Пар. 2:15"
  },
  {
    "st_no": "7",
    "st_text": "Соломон родил Ровоама; Ровоам родил Авию; Авия родил Асу;",
    "parallel": "3 Цар. 11:43 1 Пар. 3:10"
  },
  {
    "st_no": "8",
    "st_text": "Аса родил Иосафата; Иосафат родил Иорама; Иорам родил Озию;",
    "parallel": ""
  },
  {
    "st_no": "9",
    "st_text": "Озия родил Иоафама; Иоафам родил Ахаза; Ахаз родил Езекию;",
    "parallel": ""
  },
  {
    "st_no": "10",
    "st_text": "Езекия родил Манассию; Манассия родил Амона; Амон родил Иосию;",
    "parallel": ""
  },
  {
    "st_no": "11",
    "st_text": "Иосия родил Иоакима; Иоаким родил Иехонию и братьев его, перед переселением в Вавилон.",
    "parallel": "4 Цар. 23:34 1 Пар. 3:16 2 Пар. 36:4"
  },
  {
    "st_no": "12",
    "st_text": "По переселении же в Вавилон, Иехония родил Салафииля; Салафииль родил Зоровавеля;",
    "parallel": "4 Цар. 24:6 1 Пар. 3:17 2 Пар. 36:8 1 Езд. 3:2 1 Езд. 5:2 Лк. 3:27"
  },
  {
    "st_no": "13",
    "st_text": "Зоровавель родил Авиуда; Авиуд родил Елиакима; Елиаким родил Азора;",
    "parallel": "2 Пар. 36:4"
  },
  {
    "st_no": "14",
    "st_text": "Азор родил Садока; Садок родил Ахима; Ахим родил Елиуда;",
    "parallel": ""
  },
  {
    "st_no": "15",
    "st_text": "Елиуд родил Елеазара; Елеазар родил Матфана; Матфан родил Иакова;",
    "parallel": "Откр. 10:1"
  },
  {
    "st_no": "16",
    "st_text": "Иаков родил Иосифа, мужа Марии, от Которой родился Иисус, называемый Христос.",
    "parallel": "Ин. 1:14"
  },
  {
    "st_no": "17",
    "st_text": "Итак всех родов от Авраама до Давида четырнадцать родов; и от Давида до переселения в Вавилон четырнадцать родов; и от переселения в Вавилон до Христа четырнадцать родов.",
    "parallel": ""
  },
  {
    "st_no": "18",
    "st_text": "Рождество Иисуса Христа было так: по обручении Матери Его Марии с Иосифом, прежде нежели сочетались они, оказалось, что Она имеет во чреве от Духа Святаго.",
    "parallel": "Лк. 1:27"
  },
  {
    "st_no": "19",
    "st_text": "Иосиф же муж Ее, будучи праведен и не желая огласить Ее, хотел тайно отпустить Ее.",
    "parallel": ""
  },
  {
    "st_no": "20",
    "st_text": "Но когда он помыслил это, - се, Ангел Господень явился ему во сне и сказал: Иосиф, сын Давидов! не бойся принять Марию, жену твою, ибо родившееся в Ней есть от Духа Святаго;",
    "parallel": ""
  },
  {
    "st_no": "21",
    "st_text": "родит же Сына, и наречешь Ему имя Иисус, ибо Он спасет людей Своих от грехов их.",
    "parallel": "Ис. 49:1 Лк. 1:31 Лк. 1:68 Лк. 2:21 Деян. 4:12 1 Ин. 2:2 Рим. 3:24"
  },
  {
    "st_no": "22",
    "st_text": "А все сие произошло, да сбудется реченное Господом через пророка, который говорит:",
    "parallel": ""
  },
  {
    "st_no": "23",
    "st_text": "се, Дева во чреве приимет и родит Сына, и нарекут имя Ему Еммануил, что значит: с нами Бог.",
    "parallel": "Ис. 7:14"
  },
  {
    "st_no": "24",
    "st_text": "Встав от сна, Иосиф поступил, как повелел ему Ангел Господень, и принял жену свою,",
    "parallel": ""
  },
  {
    "st_no": "25",
    "st_text": "и не знал Ее. [Как] наконец Она родила Сына Своего первенца, и он нарек Ему имя: Иисус.",
    "parallel": "Лк. 2:21"
  }
]